# pandas

## 1 pandas란?

- Python에서 사용하는 데이터를 분석하는 라이브러리
- 행과 열을 쉽게 처리할 수 있는 함수를 제공하는 도구
    
    ※ 각 열은 단일 데이터 형식만 저장
    
- **numpy보다 유연하게 수치연산 가능**
- numpy는 데이터 누락을 허락하지 않지만, pandas는 데이터 누락을 허락

In [442]:
import pandas as pd
import numpy as np

pd.__version__, np.__version__

('2.2.2', '2.0.1')

## 2 Series

- 인덱스와 values로 이루어진 1차원 배열
- 모든 유형의 데이터를 보유할 수 있음
- 인덱스를 지정해 줄 수 있음
- 명시적 인덱스와 암묵적 인덱스를 가짐

### 2.1 Series 형태

- RangeIndex :  인덱스 자동 생성

* DataFrame에서 각각의 컬럼은 Series입니다.
![](https://pandas.pydata.org/docs/_images/01_table_dataframe.svg)

![](https://pandas.pydata.org/docs/_images/01_table_series.svg)

In [6]:
data = [10, 20, 30, 40, 50, 60]
data = pd.Series(data)
data # 제일 첫번째 열은 index (자동 생성!)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [11]:
print(data[0])
print(data[1])
print(data[2])
print(data[3:6])
# print(data[-1])  # 이건 err
print(data[::-1])

10
20
30
3    40
4    50
5    60
dtype: int64
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int64

In [14]:
print(type(data))
print(type(data.values)) # numpy는 pandas로 이어진다!

<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

In [16]:
data.index  # RangeIndex는 자동으로 index가 지정되었다 라는 걸 의미함.

RangeIndex(start=0, stop=6, step=1)

In [24]:
# 우리가 index를 지정해주고 싶다면, 같이 넣어주면 된다.
# 우리가 설정해주더라도, 숫자 인덱스는 자동으로 있음!
data = [10, 20, 30, 40, 50, 60]
idx = ['a', 'b', 'c', 'd', 'e', 'f']

sample = pd.Series(data,idx)
print(sample)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [31]:
print(sample['a'])

# print(sample[0]) # warning! (이후 잘못 불러올 수 있다.)

# 위치 기반 찾아오고 싶으면, iloc붙여줘야함.
print(sample.iloc[0])

10
10

In [32]:
# 잘 안 쓰지만, 이런 방법도 있다. (index관련)
print(sample.a)  # 비추!

10

### 2.2 Series의 산술 연산

In [34]:
pd.Series([10,20,30,40,50,60])

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [35]:
data = pd.Series([10,20,30,40,50,60])

In [37]:
data + 100
data - 100
data * 10
data / 10
data // 10
data % 10
data + data

0     20
1     40
2     60
3     80
4    100
5    120
dtype: int64

In [39]:
data1 = pd.Series([10, 20, 30])
data2 = pd.Series(['a','b','c'])

# data1 + data2 # error

In [40]:
data1 = pd.Series([10, 20, 30])
data2 = pd.Series(['10','20','30'])

data1 + data2.astype('int64') # error

0    20
1    40
2    60
dtype: int64

### 2.3 Series indexing , slicing, boolean indexing

In [4]:
data = [10, 20, 30, 40, 50, 60]
idx = ['a', 'b', 'c', 'd', 'e', 'f']

sample = pd.Series(data,idx)
print(sample)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [12]:
print(sample['a'])
print(sample.iloc[0])
print(sample['a':'d':2])

10
10
a    10
c    30
dtype: int64

In [13]:
data = [10, 20, 30, 40, 50, 60]
idx = ['a', 'b', 'c', 'd', 'e', 'f']

sample = pd.Series(data,idx)
print(sample)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [22]:
sample[[True,True,False,False,False,False]]

a    10
b    20
dtype: int64

In [24]:
print([i for i in sample])

[10, 20, 30, 40, 50, 60]

In [26]:
# iterate 불가 -> error
# for index, values in sample:
#     print(index, value)

In [36]:
for i, j in zip(sample.index, sample.values):
    print(i,j)

a 10
b 20
c 30
d 40
e 50
f 60

In [39]:
d = {
    '학원' : 10,
    '연구원' : 20,
    '출판사' : 30,
    '미디어사' : 40,
    '위니브' : 50
}

In [44]:
data = pd.Series(d)

print(data['학원' : '출판사'])  # 출판사까지 출력함!
print(data[0:3])

학원     10
연구원    20
출판사    30
dtype: int64
학원     10
연구원    20
출판사    30
dtype: int64

In [46]:
data

학원      10
연구원     20
출판사     30
미디어사    40
위니브     50
dtype: int64

In [48]:
data[2:]

출판사     30
미디어사    40
위니브     50
dtype: int64

In [51]:
data[:-2]

학원     10
연구원    20
출판사    30
dtype: int64

In [54]:
data[0:3]

학원     10
연구원    20
출판사    30
dtype: int64

In [56]:
data[-4::2]

연구원     20
미디어사    40
dtype: int64

In [61]:
d = {
    '2015년':100,
    '2016년':200,
    '2017년':300,
    '2018년':400,
    '2019년':1100,
    '2020년':3000,
    '2021년':6000,
    '2022년':9000,
}

pd.Series(d, index=['2016년', '2020년'])

2016년     200
2020년    3000
dtype: int64

### 2.4 Series에 key, value, index

- index
    - Series, DataFrame의 레코드를 식별
    - 집합 연산이 가능
- loc :  인덱스를 기반으로 행 데이터를 읽음 (행 번호를 loc하면 warning)
- iloc :  행 번호를 기반으로 행 데이터를 읽음
- items() : key와 value를 튜플로 묶어서 리턴
- 팬시 인덱싱(fancy indexing) : 스칼라 대신 인덱스 배열을 사용한 인덱싱

In [65]:
data = [10, 20, 30, 40, 50, 60]
index = ['a', 'b', 'c', 'd', 'e', 'f']
s = pd.Series(data, index)
s

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [76]:
print('a' in s) 
print(40 in s)  # index만 감지함.

True
False

In [69]:
# keys - items 관계! (java/c계열은 key-value 관계)
s.keys()

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [71]:
# s.values()  # err

In [77]:
list(s.items())

[('a', 10), ('b', 20), ('c', 30), ('d', 40), ('e', 50), ('f', 60)]

In [82]:
# s.loc('a') # err
print(s.loc['a'])  # index 입력하지 않아, 숫자가 자동으로 들어간 경우, 숫자 사용ㅅ
print(s.loc['a':'d'])

10
a    10
b    20
c    30
d    40
dtype: int64

In [87]:
s.iloc[0]  # loc, iloc는 index/key로 item을 보는 거니까, []사용
s.iloc[0:3]

a    10
b    20
c    30
dtype: int64

In [111]:
data = [10, 20, 30, 40, 50, 60]
index = [1,3,5,7,9,11]
s = pd.Series(data, index)
s

1     10
3     20
5     30
7     40
9     50
11    60
dtype: int64

In [112]:
# 난 index 3:5를 뽑고 싶은데,,,
# 뭔가 의미가 중의적이야,,
s[3:5]

7    40
9    50
dtype: int64

In [114]:
# 명시적으로 알 수 있도록, loc, iloc 사용해.
print(s, "\n")

# location으로 빼오기
print(s[3:5])
print(s.iloc[3:5])  # iloc : base index locate (자동 index)

# index로 빼오기
print(s.loc[3:5])  # loc: 설정해준 index로 불러기 (명시적인 index)

# print(s.iloc[3:5])   # 위치 기반
# s.loc[3:5]    # index기반

1     10
3     20
5     30
7     40
9     50
11    60
dtype: int64

7    40
9    50
dtype: int64
7    40
9    50
dtype: int64
3    20
5    30
dtype: int64

In [124]:
# 팬시 인덱싱
data = [10, 20, 30, 40, 50]
index = ['a', 'b', 'c', 'd', 'e']

# s = pd.Series(index, data)
s = pd.Series(data, index)  # data를 index로 엮을 거다. 라는 순서!
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [122]:
s[['a', 'd']]

a    10
d    40
dtype: int64

### 2.5 결측값(NaN, None) 처리

1. NaN
    - 자료형이 Float
    - 배열에서 연산할 경우 오류가 발생하지 않지만  결과값이 NaN이 됨
        - numpy : nan
        - pandas : 연산가능
2. None 
    - 자료형이 None
    - 배열 연산을 할 경우 오류가 발생
        - numpy : error
        - pandas : 연산가능

3.  처리방법 

    - isnull() : 결측값 확인 (결측 이면  True , 결측이 아니면  False )
    - notnull() : 결측값 확인 (결측 이면  False , 결측이 아니면  True )
    - dropna() : 결측값을 삭제
        - axis=0 : 행 삭제 / axis=1 : 열 삭제
        - inplace = True : drop후 원본에 반영
    - fillna(Num) : 결측을 Num 으로 채워 넣음

In [126]:
import pandas as pd
import numpy as np

In [128]:
data = [10, 20, 30, 40, 50, None]
np.array(data)

array([10, 20, 30, 40, 50, None], dtype=object)

In [143]:
data = np.array(data)
# data.sum()  # none 때문에 err

In [163]:
# nan 있어도 더하려면..
data = np.array(data, dtype=np.float32)  
total = np.nansum(data)  # NaN을 무시하고 합계 계산
print(total)  # 결과: 150.0

150.0

- 밑의 예시가 pandas는 numpy보다 유연하게 계산 가능하다는 의미
<ul>
    <li>Numpy</li>
    <ol>
        <li>np.nan이 있으면 nan</li>
        <li>None이 있으면 error</li>
    </ol>
    <li>Pandas</li>
    <ol>
        <li>np.nan가 있어도 계산됨.</li>
        <li>None이 있어도 계산됨.</li> 
    </ol>
</ul>

In [146]:
data = [10, 20, 30, 40, 50, np.nan]
data = np.array(data)
data.sum()

np.float64(nan)

In [159]:
data = [10, 20, 30, 40, 50, np.nan]
data = np.array(data)
data.sum()  # 이건 에러..

np.float64(nan)

In [162]:
data = [10, 20, 30, 40, 50, None]
data = np.array(data)
# data.sum()  # 이건 에러..

In [156]:
data = [10, 20, 30, 40, 50, np.nan]
data = pd.Series(data)
data.sum()

np.float64(150.0)

In [164]:
data = [10, 20, 30, 40, 50, None]
data = pd.Series(data)
data.sum()

np.float64(150.0)

In [166]:
data.isnull()  # null/none인 것은 true

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [170]:
data.notnull()  # null/none 인 것은 false
data.notnull().sum()  # 개수 파악

np.int64(5)

In [171]:
data.dropna()  # drop nan/none

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

In [179]:
data.fillna(0)  # 결측치를 0으로 처리
data.fillna(data.mean())  # 결측치를 평균으로 처리
data.ffill(inplace=True)  # 원본 데이터에 직접 적용
data.bfill(inplace=True)  # ㅑinplace가 false면 원본에 변경값 적용 X

In [181]:
# 간접적으로 원본 data 수정하는 법 (np, pd 전부 적용 가능!)
data = [10, 20, 30, 40, 50, None, None, 1000]
data = np.array(data)

data[1] = 100  # 수정하고자 하는 값을 변
data

array([10, 100, 30, 40, 50, None, None, 1000], dtype=object)

### 2.6 multiIndex

* 다중 인덱스입니다.
  - 유용할 것 같지만, DataFrame배우면 잘 안 씀.

In [184]:
매출 = {
    '2015년':100,
    '2016년':200,
    '2017년':300,
    '2018년':400,
    '2019년':1100,
    '2020년':3000,
    '2021년':6000,
    '2022년':9000,
}

순익 = {
    '2015년':10,
    '2016년':20,
    '2017년':30,
    '2018년':40,
    '2019년':11,
    '2020년':30,
    '2021년':60,
    '2022년':90,
}

In [223]:
print(list(매출.keys()))
print(매출['2015년'])

print("\n-------------------\n")

# 매출과 순익을 함께 묶기
매출_순익 = list(zip(매출.keys(), 매출.values(), 순익.values()))
매출_순익_numpy = np.array(매출_순익)
print(매출_순익)

print("\n-------------------\n")

print("매출 연도:", list(매출.keys()))
print("매출과 순익:", 매출_순익)

['2015년', '2016년', '2017년', '2018년', '2019년', '2020년', '2021년', '2022년']
100

-------------------

[('2015년', 100, 10), ('2016년', 200, 20), ('2017년', 300, 30), ('2018년', 400, 40), ('2019년', 1100, 11), ('2020년', 3000, 30), ('2021년', 6000, 60), ('2022년', 9000, 90)]

-------------------

매출 연도: ['2015년', '2016년', '2017년', '2018년', '2019년', '2020년', '2021년', '2022년']
매출과 순익: [('2015년', 100, 10), ('2016년', 200, 20), ('2017년', 300, 30), ('2018년', 400, 40), ('2019년', 1100, 11), ('2020년', 3000, 30), ('2021년', 6000, 60), ('2022년', 9000, 90)]

In [227]:
index1 = list(zip(["매출" for _ in range(len(매출.keys()))], 매출.keys()))
index2 = list(zip(["순익" for _ in range(len(순익.keys()))], 순익.keys()))

index = index1 + index2
index

[('매출', '2015년'),
 ('매출', '2016년'),
 ('매출', '2017년'),
 ('매출', '2018년'),
 ('매출', '2019년'),
 ('매출', '2020년'),
 ('매출', '2021년'),
 ('매출', '2022년'),
 ('순익', '2015년'),
 ('순익', '2016년'),
 ('순익', '2017년'),
 ('순익', '2018년'),
 ('순익', '2019년'),
 ('순익', '2020년'),
 ('순익', '2021년'),
 ('순익', '2022년')]

In [230]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('매출', '2015년'),
            ('매출', '2016년'),
            ('매출', '2017년'),
            ('매출', '2018년'),
            ('매출', '2019년'),
            ('매출', '2020년'),
            ('매출', '2021년'),
            ('매출', '2022년'),
            ('순익', '2015년'),
            ('순익', '2016년'),
            ('순익', '2017년'),
            ('순익', '2018년'),
            ('순익', '2019년'),
            ('순익', '2020년'),
            ('순익', '2021년'),
            ('순익', '2022년')],
           )

In [233]:
값 = list(매출.values()) + list(순익.values())
값

[100, 200, 300, 400, 1100, 3000, 6000, 9000, 10, 20, 30, 40, 11, 30, 60, 90]

In [237]:
s = pd.Series(값, index=index)
s

매출  2015년     100
    2016년     200
    2017년     300
    2018년     400
    2019년    1100
    2020년    3000
    2021년    6000
    2022년    9000
순익  2015년      10
    2016년      20
    2017년      30
    2018년      40
    2019년      11
    2020년      30
    2021년      60
    2022년      90
dtype: int64

In [243]:
s['매출'][-3:].sum()  # 최근 3년 데이터 합

np.int64(18000)

### 2.7 연산 함수와 집계 함수

- 연산 함수
    - add : 더하기 연산 함수
    - sub : 빼기 연산 함수
    - mul : 곱하기 연산 함수
    - floordiv : 나누었을 때 몫을 구하는 함수
    - div : 나누기 연산 함수
    - mod : 나머지 구하는 연산 함수
    - pow : 거듭제곱 연산 함수

- 집계 함수
    - count : 데이터 개수 구하는 함수
    - min : 최소값 구하는 함수
    - max  : 최대값 구하는 함수
    - mean : 평균 구하는 함수
    - median : 중앙값 구하는 함수
    - std : 표준편차 구하는 함수
    - var : 분산 구하는 함수
    - mad : 절대 표준편차 구하는 함수
    - describe : 기초 통계를 한 번에 볼 수 있는 함수

In [244]:
s1 = pd.Series([100, 200, 300, 400, 500])
s2 = pd.Series([10, 20, 30, 40, 50])

In [246]:
s1 + 100

0    200
1    300
2    400
3    500
4    600
dtype: int64

In [248]:
s1.add(100)

0    200
1    300
2    400
3    500
4    600
dtype: int64

In [249]:
s1 + s2

0    110
1    220
2    330
3    440
4    550
dtype: int64

In [251]:
s1.add(s2)

0    110
1    220
2    330
3    440
4    550
dtype: int64

In [252]:
s1 - s2

0     90
1    180
2    270
3    360
4    450
dtype: int64

In [253]:
s1.sub(s2)

0     90
1    180
2    270
3    360
4    450
dtype: int64

In [255]:
s1 * s2

0     1000
1     4000
2     9000
3    16000
4    25000
dtype: int64

In [256]:
s1.mul(s2)

0     1000
1     4000
2     9000
3    16000
4    25000
dtype: int64

In [257]:
s1 ** 2

0     10000
1     40000
2     90000
3    160000
4    250000
dtype: int64

In [258]:
s1.pow(2)

0     10000
1     40000
2     90000
3    160000
4    250000
dtype: int64

In [259]:
s1

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [260]:
s1.min()

np.int64(100)

In [261]:
s1.max()

np.int64(500)

In [262]:
s1.mean()

np.float64(300.0)

In [263]:
s1.median()

np.float64(300.0)

In [264]:
s1.std() # 표준편차

np.float64(158.11388300841898)

In [266]:
s1.var() # 분산

np.float64(25000.0)

In [267]:
s1.head(2)

0    100
1    200
dtype: int64

In [268]:
s1.tail(2)

3    400
4    500
dtype: int64

### 2.8 데이터 결합

- concat : 데이터 프레임이나 시리즈의 결합
    - axis=0 or 1 : 아래로 데이터 연결 / 옆으로 데이터 연결
    - verify_integrity=True일 때, 인덱스의 중복이 존재하면 error 출력
    - ignore_index : 기존의 인덱스를 무시하고 차례대로 인덱스 출력
    - join='inner' : 결합하는 데이터들의 공통 부분만 출력
    - join='outer' : 결합하는 데이터들의 모든 값 출력
- append : 마지막 행에 데이터를 추가

※ concatenate : 배열 결합

In [272]:
a = np.arange(10).reshape(2,5)
b = np.arange(10).reshape(2,5)
c = np.arange(10).reshape(2,5)
a

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [273]:
np.concatenate([a,b,c])

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9],
       [0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9],
       [0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [274]:
np.concatenate([a,b,c], axis=1)

array([[0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9, 5, 6, 7, 8, 9, 5, 6, 7, 8, 9]])

In [276]:
np.concatenate([a,b,c], axis=0)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9],
       [0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9],
       [0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [291]:
a = pd.Series(['A','B','C','D','E'], index=range(1,6))
b = pd.Series(['A','B','C','D','E'], index=range(1,6))
c = pd.Series(['A','B','C','D','E'], index=range(1,6))
a

1    A
2    B
3    C
4    D
5    E
dtype: object

In [284]:
np.concatenate([a,b,c])

array(['A', 'B', 'C', 'D', 'E', 'A', 'B', 'C', 'D', 'E', 'A', 'B', 'C',
       'D', 'E'], dtype=object)

In [287]:
a = pd.Series([['A','B'],['C','D'],['E','F']])
b = pd.Series([['A','B'],['C','D'],['E','F']])
c = pd.Series([['A','B'],['C','D'],['E','F']])
a

0    [A, B]
1    [C, D]
2    [E, F]
dtype: object

In [289]:
np.concatenate([a,b,c])

array([list(['A', 'B']), list(['C', 'D']), list(['E', 'F']),
       list(['A', 'B']), list(['C', 'D']), list(['E', 'F']),
       list(['A', 'B']), list(['C', 'D']), list(['E', 'F'])], dtype=object)

In [292]:
# np.concatenate([a,b,c], axis=1)  # 하나의 column이ㅣ에..

In [317]:
a = pd.Series(['A','B','C','D','E'], index=range(1,6))
b = pd.Series(['A','B','C','D','E'], index=range(1,6))
c = pd.Series(['A','B','C','D','E'], index=range(1,6))
a

1    A
2    B
3    C
4    D
5    E
dtype: object

In [299]:
print(np.concatenate([a,b,c]))
print(np.concatenate([a,b,c])[3])
print(type(np.concatenate([a,b,c])[3]))

['A' 'B' 'C' 'D' 'E' 'A' 'B' 'C' 'D' 'E' 'A' 'B' 'C' 'D' 'E']
D
<class 'str'>

In [303]:
# concat : data frame이나 series 결합에 사용
print(pd.concat([a,b,c]))
print("---------------")
print(pd.concat([a,b,c])[3])
print(type(pd.concat([a,b,c])[3]))

1    A
2    B
3    C
4    D
5    E
1    A
2    B
3    C
4    D
5    E
1    A
2    B
3    C
4    D
5    E
dtype: object
---------------
3    C
3    C
3    C
dtype: object
<class 'pandas.core.series.Series'>
---------------

In [305]:
pd.concat([a,b,c], axis=0)

1    A
2    B
3    C
4    D
5    E
1    A
2    B
3    C
4    D
5    E
1    A
2    B
3    C
4    D
5    E
dtype: object

In [309]:
print(pd.concat([a,b,c], axis=1))
print(type(pd.concat([a,b,c], axis=1)))

   0  1  2
1  A  A  A
2  B  B  B
3  C  C  C
4  D  D  D
5  E  E  E
<class 'pandas.core.frame.DataFrame'>

In [311]:
# verify_integrity는 중복 여부 (false면 중복 가능)
pd.concat([a,b,c], verify_integrity=False)

1    A
2    B
3    C
4    D
5    E
1    A
2    B
3    C
4    D
5    E
1    A
2    B
3    C
4    D
5    E
dtype: object

In [313]:
# 중복 data있으면 안 되고, 기존 index를 ignore (임의 재설정해줌)
pd.concat([a,b,c], verify_integrity=True, ignore_index=True)

0     A
1     B
2     C
3     D
4     E
5     A
6     B
7     C
8     D
9     E
10    A
11    B
12    C
13    D
14    E
dtype: object

In [325]:
a = pd.Series(['A','B','C','D','E'], index=range(1,6))
b = pd.Series(['A','B','C','D'], index=range(1,5))
c = pd.Series(['A','B','C','D'], index=range(1,5))
a

1    A
2    B
3    C
4    D
5    E
dtype: object

In [328]:
pd.concat([a,b,c], axis=1) # review)열 개수 유지를 위해 가로로 연산!

   0    1    2
1  A    A    A
2  B    B    B
3  C    C    C
4  D    D    D
5  E  NaN  NaN

In [330]:
# 결측치 없는 것만 보여
pd.concat([a,b,c], axis=1, join='inner')

   0  1  2
1  A  A  A
2  B  B  B
3  C  C  C
4  D  D  D

In [331]:
# 모든 데이터 보여줘
pd.concat([a,b,c], axis=1, join='outer')

   0    1    2
1  A    A    A
2  B    B    B
3  C    C    C
4  D    D    D
5  E  NaN  NaN

## 3 DataFrame

- 다차원 배열(Series의 특성을 가지고 있는 2차원 배열)
- Series가 쌓여서 구성된 것으로 생각하면 쉬움.
- 가장 기본적인 데이터 구조

### 3.1 DataFrame의 형태

```
연차  연도      매출    순익   직원수
1     2015   1000000  100001        1
2     2016   2000000  200001        2
3     2017   3000000  300001        4
4     2018   4000000  400001        8
5     2019   8000000  800001       16
6     2020  16000000 1600001       32
```

In [332]:
rawData = {
    '연차':[1, 2, 3, 4, 5, 6],
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '매출':[1000000, 2000000, 3000000, 4000000, 8000000, 16000000],
    '순익':[100001, 200001, 300001, 400001, 800001, 1600001],
    '직원수':[1, 2, 4, 8, 16, 32]
}

In [334]:
pd.DataFrame(rawData)

   연차    연도        매출       순익  직원수
0   1  2015   1000000   100001    1
1   2  2016   2000000   200001    2
2   3  2017   3000000   300001    4
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32

In [340]:
print(type(pd.DataFrame(rawData)))

<class 'pandas.core.frame.DataFrame'>

In [343]:
print(type(pd.DataFrame(rawData)['연도']))
# 이를 통해, Series들이 쌓여 DataFrame이 됨을 알 수 있다.

<class 'pandas.core.series.Series'>

In [349]:
df = pd.DataFrame(rawData)

# i(i니까, "임시" 의미로 쉽게 생각해주자..) 
# i(임시) location ::> 처음 만들어졌을 때의 index
print(df.iloc[2:5])  

# loc :: 우리가 명시해준 index 
print(df.loc[2:4])   # ::> 현재는 동일!

   연차    연도       매출      순익  직원수
2   3  2017  3000000  300001    4
3   4  2018  4000000  400001    8
4   5  2019  8000000  800001   16
   연차    연도       매출      순익  직원수
2   3  2017  3000000  300001    4
3   4  2018  4000000  400001    8
4   5  2019  8000000  800001   16

In [353]:
# index 설정에서 rawData[~~] 이렇게 직접 명명!
df = pd.DataFrame(rawData, columns=['연차','매출','순익','직원수'], index=rawData['연도'])
df

      연차        매출       순익  직원수
2015   1   1000000   100001    1
2016   2   2000000   200001    2
2017   3   3000000   300001    4
2018   4   4000000   400001    8
2019   5   8000000   800001   16
2020   6  16000000  1600001   32

In [358]:
print(df.iloc[2:4])  # 처음 생성될 때 i(임시) index로!
print("--------------")
print(df.loc[2016:2018])  # 명시적 설정해준 index로!

      연차       매출      순익  직원수
2017   3  3000000  300001    4
2018   4  4000000  400001    8
--------------
      연차       매출      순익  직원수
2016   2  2000000  200001    2
2017   3  3000000  300001    4
2018   4  4000000  400001    8

In [362]:
%%writefile rawData.csv
1, 2, 3, 4, 5, 6, 7
연차,1, 2, 3, 4, 5, 6
연도,2015, 2016, 2017, 2018, 2019, 2020
매출,1000000, 2000000, 3000000, 4000000, 8000000, 16000000
순익,100001, 200001, 300001, 400001, 800001, 1600001
직원수,1, 2, 4, 8, 16, 32

Overwriting rawData.csv

![](https://pandas.pydata.org/docs/_images/02_io_readwrite.svg)

In [364]:
pd.read_csv('rawData.csv')

     1        2        3        4        5        6         7
0   연차        1        2        3        4        5         6
1   연도     2015     2016     2017     2018     2019      2020
2   매출  1000000  2000000  3000000  4000000  8000000  16000000
3   순익   100001   200001   300001   400001   800001   1600001
4  직원수        1        2        4        8       16        32

In [366]:
pd.read_csv('rawData.csv').columns

Index(['1', ' 2', ' 3', ' 4', ' 5', ' 6', ' 7'], dtype='object')

In [372]:
pd.read_csv('rawData.csv').index

RangeIndex(start=0, stop=5, step=1)

In [377]:
!pip install lxml
!pip install html5lib beautifulsoup4

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: lxml in /home/kimse/.local/lib/python3.10/site-packages (5.3.0)
Defaulting to user installation because normal site-packages is not writeable
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: beautifulsoup4 in /home/kimse/.local/lib/python3.10/site-packages (4.12.3)
Requirement already satisfied: six>=1.9 in /home/kimse/.local/lib/python3.10/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /home/kimse/.local/lib/python3.10/site-packages (from html5lib) (0.5.1)
Requirement already satisfied: soupsieve>1.2 in /home/kimse/.local/lib/python3.10/site-packages (from beautifulsoup4) (2.6)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [379]:
df = pd.read_html('https://ko.wikipedia.org/wiki/%EB%8C%80%ED%95%9C%EB%AF%BC%EA%B5%AD%EC%9D%98_%EC%9D%B8%EA%B5%AC')
df

[   Unnamed: 0_level_0    2016           2017          2018          2019  \
    Unnamed: 0_level_1      인구   인구밀도      인구   인구밀도     인구   인구밀도     인구
 0                   계   51218    510   51362    512  51607    514  51709
 1                  서울    9843  16263    9766  16136   9705  16034   9662
 2                  부산  약3,500   4477  약3,100   4447   3400   4416   3300
 3                  대구    2461   2786    2458   2782   2450   2773   2432
 4                  인천    2907   2736    2924   2750   2939   2764   2944
 5                  광주    1502   2997    1495   2984   1493   2980   1494
 6                  대전    1536   2848    1528   2832   1518   2813   1509
 7                  울산    1166   1099    1159   1092   1154   1088   1147
 8                  세종     234    504     266    571    304    653    331
 9                  경기   12600   1237   12786   1255  13031   1279  13238
 10                 강원    1521     90    1521     90   1521     90   1517
 11                 충북    1601    216    1609    217   1619    219   1626
 12                 충남    2126    258    2153    262   2180    265   2188
 13                 전북    1835    227    1829    227   1820    226   1803
 14                 전남    1798    146    1795    146   1790    145   1773
 15                 경북    2683    141    2675    141   2674    141   2665
 16                 경남    3338    317    3339    317   3356    318   3350
 17                 제주     618    334     635    343    653    353    660
 18                수도권   25350   2139   25476   2149  25675   2165  25844

             2020
      인구밀도     인구   인구밀도
 0     515  51781    516
 1   15964   9602  15865
 2    4380   3344   4342
 3    2753   2419   2738
 4    2769   2951   2770
 5    2980   1488   2969
 6    2796   1500   2780
 7    1080   1140   1073
 8     712    349    750
 9    1299  13405   1315
 10     90   1515     90
 11    219   1632    220
 12    265   2204    267
 13    223   1792    222
 14    144   1764    143
 15    140   2655    140
 16    318   3350    318
 17    356    670    362
 18   2179  25958   2188  ,
           Unnamed: 0         Unnamed: 1     2011   2012   2013   2014   2015  \
 0               기대수명                  계    80.62  80.87  81.36  81.80  82.06
 1               기대수명                 남자    77.26  77.57  78.12  78.58  78.96
 2               기대수명                 여자    83.97  84.17  84.60  85.02  85.17
 3  유병기간제외 기대수명(건강수명)  유병기간제외 기대수명(건강수명)  (자료 없음)  65.70      -  65.20      -

    2016   2017  2018   2019
 0  82.4  82.70  82.7  83.30
 1  79.3  79.70  79.7  80.30
 2  85.4  85.70  85.7  86.30
 3  64.9      -  64.4      -  ,
   대한민국의 총인구                                                                   \
        1949         1955         1970         1980         1985         1995
 0  20166756  ↗21,502,386  ↗31,435,252  ↗37,406,815  ↗40,419,652  ↗44,553,710

                                                                     \
           2005         2010         2015         2018         2019
 0  ↗47,041,434  ↗47,990,761  ↗51,069,375  ↗51,629,512  ↗51,779,203


           2020
 0  ↗51,829,136  ,
   대한민국의 주민등록 인구                                                      \
            2008         2009         2010         2013         2015
 0      49540367  ↗49,773,145  ↗50,515,666  ↗51,141,463  ↗51,529,338

                                                                     \
           2016         2018     2019. 10     2019. 11     2019. 12
 0  ↗51,696,216  ↗51,826,059  ↗51,850,705  ↗51,851,427  ↘51,849,861


           2020     2021. 07
 0  ↘51,779,203  ↘51,671,569  ,
     연도 (년)   추계인구(명)  출생자수(명)  사망자수(명)  자연증가수(명)  조출생률 (1000명당)  \
 0     1925  12997611   558897   359042    199855           43.0
 1     1926  13052741   511667   337948    173719           39.2
 2     1927  13037169   534524   353818    180706           41.0
 3     1928  13105131   566142   357701    208441           43.2
 4     1929  13124279   566969   414366    152603           43.2
 5     1930  13880469   587144   322611    264533           42.3
 6     1931  13895052   589428   346800    242628           42.4
 7     1932  14117191   600545   384287    216258           42.5
 8     1933  14229277   607021   336232    270789           42.7
 9     1934  14449155   618135   356515    261620           42.8
 10    1935  15061960   646158   377454    268704           42.9
 11    1936  15114775   639355   381806    257549           42.3
 12    1937  15235383   636839   342575    294264           41.8
 13    1938  15358193   569299   347025    222274           37.1
 14    1939  15486028   585482   353391    232091           37.8
 15    1940  15559741   527964   358496    169468           33.9
 16    1941  15745478   553690   366239    187451           35.2
 17    1942  16013742   533768   376003    157765           33.3
 18    1943  16239721   513846   384881    128965           31.6
 19    1944  16599172   533215   380121    153094           32.1

     조사망률 (1000명당)  자연증가율 (1000명당)  합계출산율
 0            27.6            15.4   6.59
 1            25.9            13.3    NaN
 2            27.1            13.9    NaN
 3            27.3            15.9    NaN
 4            31.6            11.6    NaN
 5            23.2            19.1   6.41
 6            25.0            17.4    NaN
 7            27.2            15.3    NaN
 8            23.6            19.1    NaN
 9            24.7            18.1    NaN
 10           25.1            17.8   6.60
 11           25.3            17.0    NaN
 12           22.5            19.3    NaN
 13           22.6            14.5    NaN
 14           22.8            15.0    NaN
 15           23.0            10.9   6.56
 16           23.3            11.9    NaN
 17           23.5             9.8    NaN
 18           23.7             7.9    NaN
 19           22.9             9.2   6.78  ,
     연도 (년)   추계인구(명)  출생자수(명)  사망자수(명)  자연증가수(명)  조출생률 (1000명당)  \
 0     1945  16695819   544786   367308    177478           32.6
 1     1946  19369270   590763   410629    180134           30.5
 2     1947  19836234   686334   361019    325315           35.0
 3     1948  20027393   692948   374512    318436           34.6
 4     1949  20188641   696508   341188    355320           34.5
 ..     ...       ...      ...      ...       ...            ...
 74    2019  51764822   303054   295132      7922            5.9
 75    2020  51836239   272337   304948    -32611            5.3
 76    2021  51744876   260562   317680    -57118            5.1
 77    2022  51628117   249186   372939   -123753            4.9
 78    2023  51430018   229971   352721   -122750            4.5

     조사망률 (1000명당)  자연증가율 (1000명당)  합계출산율
 0            22.0            10.6    NaN
 1            21.2             9.3    NaN
 2            18.2            16.8    NaN
 3            18.7            15.9    NaN
 4            16.9            17.6    NaN
 ..            ...             ...    ...
 74            5.7             0.2  0.918
 75            5.9            -0.6  0.837
 76            6.2            -1.1  0.808
 77            7.3            -2.4  0.778
 78            6.9            -2.4  0.720

 [79 rows x 9 columns],
      연도  1908  1913  1918  1923  1928  1933  1938  1942  1950[21]
 0  기대수명  23.5  25.0  27.0  29.5  33.6  37.4  42.6  44.9      46.7,
           기간  기대수명       기간.1  기대수명.1
 0  1950–1955  47.9  1985–1990    70.3
 1  1955–1960  51.2  1990–1995    72.9
 2  1960–1965  54.8  1995–2000    75.0
 3  1965–1970  58.8  2000–2005    77.2
 4  1970–1975  63.1  2005–2010    79.4
 5  1975–1980  65.0  2010–2015    81.3
 6  1980–1985  67.4  2015-2020    83.5,
       연도  1900  1901  1902  1903  1904  1905  1906  1907  1908  1909  1910[22]
 0  합계출산율     6     6  5.99  5.99  5.98  5.98  5.97  5.96  5.96  5.96       NaN,
       연도  1911  1912  1913  1914  1915  1916  1917  1918  1919  1920[22]
 0  합계출산율  5.95  5.95  5.94  5.94  5.93  5.93  5.92  5.92  5.93      5.94,
       연도  1921  1922  1923  1924[22]
 0  합계출산율  5.95  5.96  5.97      5.95,
    Unnamed: 0_level_0  2021년 6월
    Unnamed: 0_level_1     총 인구수       세대수 세대당 인구    남자 인구수    여자 인구수 남여 비율
 0                  전국  51672400  23256332   2.22  25770033  25902367  0.99
 1               서울특별시   9565990   4405638   2.17   4649442   4916548  0.95
 2               부산광역시   3364358   1533514   2.19   1647291   1717067  0.96
 3               대구광역시   2397646   1059826   2.26   1182380   1215266  0.97
 4               인천광역시   2936367   1280291   2.29   1470544   1465823  1.00
 5               광주광역시   1442647    638270   2.26    713793    728854  0.98
 6               대전광역시   1456107    657781   2.21    726666    729441  1.00
 7               울산광역시   1126369    479971   2.35    578924    547445  1.06
 8             세종특별자치시    362995    148604   2.44    181328    181667  1.00
 9                 경기도  13500688   5763227   2.34   6795088   6705600  1.01
 10                강원도   1535530    738068   2.08    772949    762581  1.01
 11               충청북도   1597503    752237   2.12    810225    787278  1.03
 12               충청남도   2117400    991636   2.14   1082113   1035287  1.05
 13               전라북도   1794345    842662   2.13    892670    901675  0.99
 14               전라남도   1840921    897529   2.05    926398    914523  1.01
 15               경상북도   2632401   1266588   2.08   1326844   1305557  1.02
 16               경상남도   3325840   1496137   2.22   1674612   1651228  1.01
 17            제주특별자치도    675293    304353   2.22    338766    336527  1.01,
    Unnamed: 0_level_0 2021.07 연령별 인구현황                                      \
    Unnamed: 0_level_1          주민등록 인구     0-9세   10-19세   20-29세   30-39세
 0                  전국         51671569  3843759  4737829  6733054  6764334
 1               서울특별시          9558153   599600   764952  1440484  1449434
 2               부산광역시          3361781   224799   267659   422488   409975
 3               대구광역시          2395749   171893   220577   315051   287590
 4               인천광역시          2937440   221097   271547   394550   400637
 5               광주광역시          1442482   116003   153869   207814   182548
 6               대전광역시          1455300   110138   143598   210655   190813
 7               울산광역시          1125727    94428   110546   140710   147449
 8             세종특별자치시           364364    46995    44340    38265    61176
 9                 경기도         13512867  1119413  1326320  1809310  1898501
 10                강원도          1536140   102580   135021   176875   163235
 11               충청북도          1597501   119553   147224   196710   192127
 12               충청남도          2118205   166848   201286   240255   262268
 13               전라북도          1793902   123179   171743   209534   184768
 14               전라남도          1839698   127179   164477   197212   181118
 15               경상북도          2631649   182918   223455   280421   283759
 16               경상남도          3324735   257940   320906   370748   387531
 17            제주특별자치도           675876    59196    70309    81972    81405


      40-49세   50-59세   60-69세   70-79세   80-89세  90-99세 100세 이상
 0   8205797  8591085  7039371  3699044  1790233  256245   10818
 1   1497354  1505745  1274190   696452   286511   40954    2477
 2    505116   556481   544644   294713   120274   14876     756
 3    376422   419517   337985   175933    80677    9732     372
 4    480528   508488   388725   178261    80508   12554     545
 5    237460   233995   169107    94071    41385    5997     233
 6    233122   239271   187703    91741    42113    5937     209
 7    184951   206594   152653    61642    23542    3129      83
 8     71019    46878    32468    14554     7365    1268      36
 9   2295435  2249247  1625682   769763   363493   53391    2312
 10   220452   263759   253985   133653    74741   11374     465
 11   238200   269459   236905   119913    67734    9360     316
 12   326371   337638   294422   171492   102261   14845     519
 13   262826   297818   264807   170737    93733   14225     532
 14   254908   311829   280838   191252   113467   16821     597
 15   378861   453913   427094   241786   139206   19584     652
 16   531015   576482   485482   247494   128534   18093     510
 17   111757   113971    82681    45587    24689    4105     204  ,
    Unnamed: 0_level_0 2020 통계청 인구주택총조사                                \
    Unnamed: 0_level_1              총인구        남자        여자       내국인
 0                  전국         51829136  25915207  25913929  50133493
 1                  읍부          5113052   2624351   2488701   4904647
 2                  면부          4650781   2420392   2230389   4394145
 3                  동부         42065303  20870464  21194839  40834701
 4               서울특별시          9586195   4647733   4938462   9219741
 5               부산광역시          3349016   1638751   1710265   3294102
 6               대국광역시          2410700   1190271   1220429   2373302
 7               인천광역시          2945454   1477064   1468390   2846242
 8               광주광역시          1477573    734140    743433   1447000
 9               대전광역시          1488435    744349    744086   1465507
 10              울산광역시          1135423    585978    549445   1108528
 11            세종특별자치시           353933    177939    175994    346689
 12                경기도         13511676   6828367   6683309  12928214
 13                강원도          1521763    767674    754089   1497109
 14               충청북도          1632088    833819    798269   1574994
 15               충청남도          2176636   1117575   1059061   2077470
 16               전라북도          1802766    899058    903708   1760400
 17               전라남도          1788807    903281    885526   1743571
 18               경상북도          2644757   1338823   1305934   2570210
 19               경상남도          3333056   1692212   1640844   3236387
 20            제주특별자치도           670858    338173    332685    644027


       내국인-남자    내국인-여자  외국인-남자  외국인-여자
 0   24972588  25160905  942619  753024
 1    2494271   2410376  130080   78325
 2    2237761   2156384  182631   74005
 3   20240556  20594145  629908  600694
 4    4474343   4745398  173390  193064
 5    1608877   1685225   29874   25040
 6    1170625   1202677   19646   17752
 7    1422376   1423866   54688   44524
 8     717832    729168   16308   14265
 9     733852    731655   10497   12431
 10    570131    538397   15847   11048
 11    173541    173148    4398    2846
 12   6489718   6438496  338649  244813
 13    754831    742278   12843   11811
 14    799168    775826   34651   22443
 15   1058869   1018601   58706   40460
 16    876451    883949   22607   19759
 17    875732    867839   27549   17687
 18   1294138   1276072   44685   29862
 19   1629100   1607287   63112   33557
 20    323004    321023   15169   11662  ,
    Unnamed: 0_level_0 2020 통계청 인구주택총조사 연령 및 성별 인구                          \
    Unnamed: 0_level_1                         총인구          남자          여자
 0                  전체                  51829136.0  25915207.0  25913929.0
 1                0~4세                   1722081.0    883196.0    838885.0
 2                5~9세                   2264595.0   1161247.0   1103348.0
 3              10~14세                   2267481.0   1168937.0   1098544.0
 4              15~19세                   2449561.0   1271404.0   1178157.0
 5              20~24세                   3364804.0   1762135.0   1602669.0
 6              25~29세                   3666212.0   1959723.0   1706489.0
 7              30~34세                   3301331.0   1742483.0   1558848.0
 8              35~39세                   3805470.0   1970249.0   1835221.0
 9              40~44세                   3906665.0   1997630.0   1909035.0
 10             45~49세                   4325697.0   2196042.0   2129655.0
 11             50~54세                   4372054.0   2195060.0   2176994.0
 12             55~59세                   4210645.0   2109380.0   2101265.0
 13             60~64세                   3885297.0   1912792.0   1972505.0
 14             65~69세                   2734187.0   1314575.0   1419612.0
 15             70~74세                   2027679.0    946539.0   1081140.0
 16             75~79세                   1600867.0    684291.0    916576.0
 17             80~84세                   1120781.0    419037.0    701744.0
 18              85세이상                    803729.0    220487.0    583242.0
 19             85~89세                    563930.0    168643.0    395287.0
 20             90~94세                    192663.0     42951.0    149712.0
 21             95~99세                     41512.0      8024.0     33488.0
 22             100세이상                      5624.0       869.0      4755.0
 23              15세미만                   6254157.0   3213380.0   3040777.0
 24             15~64세                  37287736.0  19116898.0  18170838.0
 25              65세이상                   8287243.0   3584929.0   4702314.0
 26               평균연령                        42.9        41.7        44.1
 27               중위연령                        43.9        42.5        45.3


        성비         내국인      내국인-남자      내국인-여자 내국인-성비
 0   100.0  50133493.0  24972588.0  25160905.0   99.3
 1   105.3   1684917.0    864276.0    820641.0  105.3
 2   105.2   2238916.0   1148248.0   1090668.0  105.3
 3   106.4   2252113.0   1161098.0   1091015.0  106.4
 4   107.9   2422002.0   1258885.0   1163117.0  108.2
 5   110.0   3193316.0   1670636.0   1522680.0  109.7
 6   114.8   3423231.0   1813896.0   1609335.0  112.7
 7   111.8   3032832.0   1579900.0   1452932.0  108.7
 8   107.4   3594213.0   1841713.0   1752500.0  105.1
 9   104.6   3758298.0   1909518.0   1848780.0  103.3
 10  103.1   4195327.0   2123611.0   2071716.0  102.5
 11  100.8   4245683.0   2130025.0   2115658.0  100.7
 12  100.4   4091920.0   2051221.0   2040699.0  100.5
 13   97.0   3795217.0   1869359.0   1925858.0   97.1
 14   92.6   2685773.0   1291921.0   1393852.0   92.7
 15   87.6   2009542.0    938910.0   1070632.0   87.7
 16   74.7   1593192.0    681766.0    911426.0   74.8
 17   59.7   1115804.0    417754.0    698050.0   59.8
 18   37.8    801197.0    219851.0    581346.0   37.8
 19   42.7    562068.0    168181.0    393887.0   42.7
 20   28.7    192149.0     42825.0    149324.0   28.7
 21   24.0     41399.0      7995.0     33404.0   23.9
 22   18.3      5581.0       850.0      4731.0   18.0
 23  105.7   6175946.0   3173622.0   3002324.0  105.7
 24  105.2  35752039.0  18248764.0  17503275.0  104.3
 25   76.2   8205508.0   3550202.0   4655306.0   76.3
 26      -        43.1        41.9        44.2      -
 27      -        44.3        42.9        45.6      -  ,
    Unnamed: 0_level_0 2020 행정구역별 가구원수별 가구(일반가구)[31]                    \
    Unnamed: 0_level_1                        일반가구_계       1인       2인
 0                  전국                      20926710  6643354  5864525
 1               서울특별시                       3982290  1390701  1033901
 2               부산광역시                       1405037   455207   411455
 3               대구광역시                        985816   304543   276237
 4               인천광역시                       1147200   324841   316387
 5               광주광역시                        599217   193948   162403
 6               대전광역시                        631208   228842   164795
 7               울산광역시                        444087   122848   123591
 8             세종특별자치시                        139106    43577    33204
 9                 경기도                       5098431  1406010  1350139
 10                강원도                        661039   231371   206755
 11               충청북도                        678922   236208   198840
 12               충청남도                        892222   304973   264909
 13               전라북도                        755575   255269   233334
 14               전라남도                        761518   256633   251506
 15               경상북도                       1131819   388791   363061
 16               경상남도                       1350155   417737   399700
 17            제주특별자치도                        263068    81855    74308



In [381]:
df[4]

,연도 (년),추계인구(명),출생자수(명),사망자수(명),자연증가수(명),조출생률 (1000명당),조사망률 (1000명당),자연증가율 (1000명당),합계출산율
0,1925,12997611,558897,359042,199855,43.0,27.6,15.4,6.59
1,1926,13052741,511667,337948,173719,39.2,25.9,13.3,NaN
2,1927,13037169,534524,353818,180706,41.0,27.1,13.9,NaN
3,1928,13105131,566142,357701,208441,43.2,27.3,15.9,NaN
4,1929,13124279,566969,414366,152603,43.2,31.6,11.6,NaN
5,1930,13880469,587144,322611,264533,42.3,23.2,19.1,6.41
6,1931,13895052,589428,346800,242628,42.4,25.0,17.4,NaN
7,1932,14117191,600545,384287,216258,42.5,27.2,15.3,NaN
8,1933,14229277,607021,336232,270789,42.7,23.6,19.1,NaN
9,1934,14449155,618135,356515,261620,42.8,24.7,18.1,NaN
10,1935,15061960,646158,377454,268704,42.9,25.1,17.8,6.60
11,1936,15114775,639355,381806,257549,42.3,25.3,17.0,NaN
12,1937,15235383,636839,342575,294264,41.8,22.5,19.3,NaN
13,1938,15358193,569299,347025,222274,37.1,22.6,14.5,NaN
14,1939,15486028,585482,353391,232091,37.8,22.8,15.0,NaN
15,1940,15559741,527964,358496,169468,33.9,23.0,10.9,6.56
16,1941,15745478,553690,366239,187451,35.2,23.3,11.9,NaN
17,1942,16013742,533768,376003,157765,33.3,23.5,9.8,NaN
18,1943,16239721,513846,384881,128965,31.6,23.7,7.9,NaN
19,1944,16599172,533215,380121,153094,32.1,22.9,9.2,6.78

In [382]:
df[0]

   Unnamed: 0_level_0    2016           2017          2018          2019  \
   Unnamed: 0_level_1      인구   인구밀도      인구   인구밀도     인구   인구밀도     인구
0                   계   51218    510   51362    512  51607    514  51709
1                  서울    9843  16263    9766  16136   9705  16034   9662
2                  부산  약3,500   4477  약3,100   4447   3400   4416   3300
3                  대구    2461   2786    2458   2782   2450   2773   2432
4                  인천    2907   2736    2924   2750   2939   2764   2944
5                  광주    1502   2997    1495   2984   1493   2980   1494
6                  대전    1536   2848    1528   2832   1518   2813   1509
7                  울산    1166   1099    1159   1092   1154   1088   1147
8                  세종     234    504     266    571    304    653    331
9                  경기   12600   1237   12786   1255  13031   1279  13238
10                 강원    1521     90    1521     90   1521     90   1517
11                 충북    1601    216    1609    217   1619    219   1626
12                 충남    2126    258    2153    262   2180    265   2188
13                 전북    1835    227    1829    227   1820    226   1803
14                 전남    1798    146    1795    146   1790    145   1773
15                 경북    2683    141    2675    141   2674    141   2665
16                 경남    3338    317    3339    317   3356    318   3350
17                 제주     618    334     635    343    653    353    660
18                수도권   25350   2139   25476   2149  25675   2165  25844

            2020
     인구밀도     인구   인구밀도
0     515  51781    516
1   15964   9602  15865
2    4380   3344   4342
3    2753   2419   2738
4    2769   2951   2770
5    2980   1488   2969
6    2796   1500   2780
7    1080   1140   1073
8     712    349    750
9    1299  13405   1315
10     90   1515     90
11    219   1632    220
12    265   2204    267
13    223   1792    222
14    144   1764    143
15    140   2655    140
16    318   3350    318
17    356    670    362
18   2179  25958   2188

In [384]:
df[1]

,Unnamed: 0,Unnamed: 1,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,기대수명,계,80.62,80.87,81.36,81.80,82.06,82.4,82.70,82.7,83.30
1,기대수명,남자,77.26,77.57,78.12,78.58,78.96,79.3,79.70,79.7,80.30
2,기대수명,여자,83.97,84.17,84.60,85.02,85.17,85.4,85.70,85.7,86.30
3,유병기간제외 기대수명(건강수명),유병기간제외 기대수명(건강수명),(자료 없음),65.70,-,65.20,-,64.9,-,64.4,-

In [389]:
print(df[4]['출생자수(명)'])
print(df[4]['출생자수(명)'].sum())

0     558897
1     511667
2     534524
3     566142
4     566969
5     587144
6     589428
7     600545
8     607021
9     618135
10    646158
11    639355
12    636839
13    569299
14    585482
15    527964
16    553690
17    533768
18    513846
19    533215
Name: 출생자수(명), dtype: int64
11480088

In [391]:
df[4].to_csv('대한민국출생인구통계.csv')

## 4 DataFrame에 데이터 활용

### 4.1 데이터 사전 분석

- info() : DataFrame을 구성하는 행과 열에 대한 정보를 나타내 주는 함수
- head(n) : DataFrame의 처음부터 n줄의 행을 출력
- tail(n) : DataFrame의 마지막 n줄의 행을 출력
- describe() : Series, DataFrame의 각 열에 대한 요약 통계
- dtypes : 데이터 자료형 확인

### 4.2 DataFrame에 데이터 조작

- np.nan : NaN으로 값을 채움
- drop : 컬럼 삭제
    - inplace = True : drop후 원본에 반영
- pd.to_numeric() : 문자형을 숫자형으로 변환

In [392]:
rawData = {
    '연차':[1, 2, 3, 4, 5, 6],
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '매출':[1000000, 2000000, 3000000, 4000000, 8000000, 16000000],
    '순익':[100001, 200001, 300001, 400001, 800001, 1600001],
    '직원수':[1, 2, 4, 8, 16, 32]
}

df = pd.DataFrame(rawData)

In [394]:
df

   연차    연도        매출       순익  직원수
0   1  2015   1000000   100001    1
1   2  2016   2000000   200001    2
2   3  2017   3000000   300001    4
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32

In [396]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연차      6 non-null      int64
 1   연도      6 non-null      int64
 2   매출      6 non-null      int64
 3   순익      6 non-null      int64
 4   직원수     6 non-null      int64
dtypes: int64(5)
memory usage: 368.0 bytes

In [398]:
df.head(4)  # data 잘 들어왔는지 확인할 때, 많이 사용

   연차    연도       매출      순익  직원수
0   1  2015  1000000  100001    1
1   2  2016  2000000  200001    2
2   3  2017  3000000  300001    4
3   4  2018  4000000  400001    8

In [399]:
df.tail(3)

   연차    연도        매출       순익  직원수
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32

In [401]:
df.describe() # 열에 대한 요약 통계

             연차           연도            매출            순익        직원수
count  6.000000     6.000000  6.000000e+00  6.000000e+00   6.000000
mean   3.500000  2017.500000  5.666667e+06  5.666677e+05  10.500000
std    1.870829     1.870829  5.609516e+06  5.609516e+05  11.861703
min    1.000000  2015.000000  1.000000e+06  1.000010e+05   1.000000
25%    2.250000  2016.250000  2.250000e+06  2.250010e+05   2.500000
50%    3.500000  2017.500000  3.500000e+06  3.500010e+05   6.000000
75%    4.750000  2018.750000  7.000000e+06  7.000010e+05  14.000000
max    6.000000  2020.000000  1.600000e+07  1.600001e+06  32.000000

In [403]:
df.dtypes

연차     int64
연도     int64
매출     int64
순익     int64
직원수    int64
dtype: object

In [405]:
df

   연차    연도        매출       순익  직원수
0   1  2015   1000000   100001    1
1   2  2016   2000000   200001    2
2   3  2017   3000000   300001    4
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32

In [408]:
df['매출']
df.매출

0     1000000
1     2000000
2     3000000
3     4000000
4     8000000
5    16000000
Name: 매출, dtype: int64

In [424]:
df['순이익률'] = 1000
df

   연차    연도        매출       순익  직원수  순이익률
0   1  2015   1000000   100001    1  1000
1   2  2016   2000000   200001    2  1000
2   3  2017   3000000   300001    4  1000
3   4  2018   4000000   400001    8  1000
4   5  2019   8000000   800001   16  1000
5   6  2020  16000000  1600001   32  1000

In [420]:
df['순이익률'] = (df['순익'] / df['매출']) * 100
df

   연차    연도        매출       순익  직원수       순이익률
0   1  2015   1000000   100001    1  10.000100
1   2  2016   2000000   200001    2  10.000050
2   3  2017   3000000   300001    4  10.000033
3   4  2018   4000000   400001    8  10.000025
4   5  2019   8000000   800001   16  10.000013
5   6  2020  16000000  1600001   32  10.000006

In [421]:
# drop은 사라진 것을 보여주는 것일 뿐, 원본에 영향을 주지는 않음.
print(df.drop("순이익률", axis="columns"))
print(df)

   연차    연도        매출       순익  직원수
0   1  2015   1000000   100001    1
1   2  2016   2000000   200001    2
2   3  2017   3000000   300001    4
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32
   연차    연도        매출       순익  직원수       순이익률
0   1  2015   1000000   100001    1  10.000100
1   2  2016   2000000   200001    2  10.000050
2   3  2017   3000000   300001    4  10.000033
3   4  2018   4000000   400001    8  10.000025
4   5  2019   8000000   800001   16  10.000013
5   6  2020  16000000  1600001   32  10.000006

In [425]:
# inplace=True를 해주면, 원본을 바꾸는 것임!
print(df.drop("순이익률", axis="columns", inplace=True))
df

None

   연차    연도        매출       순익  직원수
0   1  2015   1000000   100001    1
1   2  2016   2000000   200001    2
2   3  2017   3000000   300001    4
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32

In [429]:
df['test'] = np.nan
df['test1'] = None
df

   연차    연도        매출       순익  직원수  test test1
0   1  2015   1000000   100001    1   NaN  None
1   2  2016   2000000   200001    2   NaN  None
2   3  2017   3000000   300001    4   NaN  None
3   4  2018   4000000   400001    8   NaN  None
4   5  2019   8000000   800001   16   NaN  None
5   6  2020  16000000  1600001   32   NaN  None

In [444]:
df[ ['test', 'test1'] ] = 100
df

   연차    연도        매출       순익  직원수  test  test1
0   1  2015   1000000   100001    1   100    100
1   2  2016   2000000   200001    2   100    100
2   3  2017   3000000   300001    4   100    100
3   4  2018   4000000   400001    8   100    100
4   5  2019   8000000   800001   16   100    100
5   6  2020  16000000  1600001   32   100    100

In [445]:
del df['test']   # 원본 영향 有
df

   연차    연도        매출       순익  직원수  test1
0   1  2015   1000000   100001    1    100
1   2  2016   2000000   200001    2    100
2   3  2017   3000000   300001    4    100
3   4  2018   4000000   400001    8    100
4   5  2019   8000000   800001   16    100
5   6  2020  16000000  1600001   32    100

In [446]:
# del df['test1']  
# 차라리 axis에 영향을 주는 걸 명시적으로 적는 것도.. col=1, row=0
print(df.drop("test1", axis="columns", inplace=True))
df

None

   연차    연도        매출       순익  직원수
0   1  2015   1000000   100001    1
1   2  2016   2000000   200001    2
2   3  2017   3000000   300001    4
3   4  2018   4000000   400001    8
4   5  2019   8000000   800001   16
5   6  2020  16000000  1600001   32

In [450]:
# append가 사라진 관계로 해당 부분은 기술하지 않습니다.
# df2 = pd.DataFrame(
#     np.array([ [7,
#                 2021,
#                 16000000,
#                 1600001,
#                 60] ]),
#     columns=['연차',
#              '연도',
#              '매출',
#              '순익',
#              '직원수']).append(df, ignore_index=True)

In [453]:
data = pd.Series([1, '2', '3', 'sbell', True, 10, 1])
data

# 이건 불가. -> 따라서 Series는 모두 같은 type이어야함
# data.astype('int16')

0        1
1        2
2        3
3    sbell
4     True
5       10
6        1
dtype: object

In [457]:
# 위의 error 무시하는 코드 (사용 권장 X)
pd.to_numeric(pd.Series([1, '2', '3', 'sbell', True, 10, 1]), errors='ignore')

/tmp/ipykernel_4681/575592622.py:2: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead
  pd.to_numeric(pd.Series([1, '2', '3', 'sbell', True, 10, 1]), errors='ignore')

0        1
1        2
2        3
3    sbell
4     True
5       10
6        1
dtype: object

In [463]:
# 다음 방식으로 처리 가능!
a = pd.to_numeric(pd.Series([1, '2', '3', 'sbell', True, 10, 1]), errors='coerce')
a = a.dropna()  # 이 함수도 기억해!
a

0     1.0
1     2.0
2     3.0
4     1.0
5    10.0
6     1.0
dtype: float64

### 4.3 MultiIndex

- Index를 설정할 때 리스트의 리스트 형태로 넣어주면 다중 인덱스가 설정이 된다.

In [465]:
import numpy as np

print(np.random.rand(4, 2)) # 0부터 1사이, 균일 분포, Matrix 생성
print(np.random.randint(10)) # 0부터 9사이, 숫자 1개 생성
print(np.random.randint(10, 20, size=10))
print(np.random.randint(10, 20, size=(3, 5)))
print(np.random.randn(4, 2)) # 가우시안 표준 정규분포, Matrix 생성
print(np.unique([1, 1, 1, 2, 2, 3])) # 중복된 값 제거
print(np.random.choice(10, 5, replace=False))  # 5개만 선택, replace는 중복허락함

[[0.04571913 0.00506438]
 [0.61859017 0.37410626]
 [0.18804726 0.7789116 ]
 [0.89385356 0.69688937]]
4
[16 14 11 12 12 19 17 18 18 11]
[[11 14 17 16 11]
 [17 13 13 13 11]
 [15 14 13 17 11]]
[[-0.08893989 -0.10849003]
 [ 0.23358879  0.61011967]
 [ 0.05531043 -0.29399018]
 [ 0.19578233  0.1950682 ]]
[1 2 3]
[8 2 1 7 3]

In [466]:
import pandas as pd

df = pd.DataFrame(np.random.randint(50, 100, size=(4, 3)),
            index=[['1학년', '1학년', '2학년', '2학년'], ['1반', '2반', '1반', '2반']],
            columns=['국', '영', '수'])

df

         국   영   수
1학년 1반  80  95  68
    2반  91  86  64
2학년 1반  64  87  99
    2반  80  75  70

In [468]:
df = pd.DataFrame(np.random.randint(50, 100, size=(4, 3)))

df

    0   1   2
0  90  96  98
1  84  53  96
2  98  53  85
3  51  51  79

In [470]:
list(df.index)

[0, 1, 2, 3]

In [471]:
df.index = ['1반', '2반', '3반', '4반']
df

     0   1   2
1반  90  96  98
2반  84  53  96
3반  98  53  85
4반  51  51  79

In [472]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [473]:
df.columns = ['국', '영', '수']
df

     국   영   수
1반  90  96  98
2반  84  53  96
3반  98  53  85
4반  51  51  79

In [474]:
df.index = [['1학년', '1학년', '2학년', '2학년'], ['1반', '2반', '1반', '2반']]
df

         국   영   수
1학년 1반  90  96  98
    2반  84  53  96
2학년 1반  98  53  85
    2반  51  51  79

In [475]:
df.columns = [['언어', '언어', '수리'],['국', '영', '수']]

df

        언어      수리
         국   영   수
1학년 1반  90  96  98
    2반  84  53  96
2학년 1반  98  53  85
    2반  51  51  79

In [476]:
df['언어']

         국   영
1학년 1반  90  96
    2반  84  53
2학년 1반  98  53
    2반  51  51

In [478]:
df['언어']['국']

1학년  1반    90
     2반    84
2학년  1반    98
     2반    51
Name: 국, dtype: int64

In [479]:
df.T

     1학년     2학년
      1반  2반  1반  2반
언어 국  90  84  98  51
   영  96  53  53  51
수리 수  98  96  85  79